AI專題報告
標題:  Hospital Assistant

組員:	 陳亞生(組長)、盧冠宏(副組長)、陳泓睿、賀俊賢、陳彥蓉、鄧鈺蓉

提案:
Why(提案動機)?
1.	某醫院提出病患預約排程檢查時間過長，我們透過某醫院提供資料發現，每日預約雖然排程是滿檔，但是機台使用率卻呈現不平均且未達最高的使用狀況。
2.	統計資料平均為重大病症檢查項目，希望能改善病患的病情，調整身體。
3.	利用美國CT醫療Ｘ光開放資料，利用圖片辨識，進而協助醫生做初步診斷。
Who(分析結果的使用目標族群)?
1.	醫院工作人員
2.	病患

Where(分析的原始資料來源)?
1.	某醫院資料
2.	健康保健網站
3.	美國醫療網站
What(預計的分析結果)?
1.	透過模型縮短院內病患預約排程時間
2.	提升機台使用率，進而提升院內營業額
3.	透過爬網提供合適的健康保健資訊
4.	透過CT圖片辨識模型，協助醫院工作人員判斷CT資料。


專題重點: 
1.	醫療檢查時間分析
甲、	病患檢查時間預測：利用資料預測準確時間
乙、	醫療檢查排程優化：利用預測時間，改善檢查預約排程，減少每日機台空閒時間。
2.	文字辨識 醫療保健推薦系統
甲、	文字辨識：Line-Chatbot前端，能夠判讀病患搜尋文字，並提供準確資訊。
乙、	推薦系統：除了病患查詢資訊外，可提供相關聯的其他資訊。
3.	圖片辨識 CT影像初步判斷
甲、	圖片辨識：Deep-learning
